havent 10
gotten 2
around 10
playing 35
campaign 5
multiplayer 7
solid 5
pretty 13
fun 50
zero 4
dark 3
pack 3
online 9
pass 3
access 4
game 392
great 85
condition 10
enjoy 4
tracks 7
race 10
america 2
many 7
more 59
start 11
off 21
saying 3
never 19
played 21
games 73
second 4
person 3
shooter 4
own 4
lot 27
has 43
good 83
graphics 41
nice 8
story 12
line 5
does 24
take 8
skill 4
through 9
levels 5
players 4
three 5
choose 4
based 3
level 14
looking 15
current 4
type 7
play 81
buy 46
need 19
speed 6
bought 39
years 10
ago 2
lost 5
down 8
memory 36
lane 2
brought 4
memories 4
times 11
love 25
had 49
best 26
not 158
try 16
u 6
like 77
racing 13
might 13
kinda 2
old 15
expecting 2
gift 10
granddaughter 2
likes 5
music 8
sounds 2
house 2
separate 3
computer 22
money 27
hours 9
works 56
n 4
daughter 3
sing 3
together 3
arrived 13
b 2
suppose 3
too 31
very 87
happy 15
purchase 7
grandson 4
loves 13
right 26
activities 2
program 2
takes 9
completed 2
son 11
math 4
star 15
wars 6
recommend 24
kids 13
find 12
boring 7
feel 14
skills 5
allows 2
several 6
ways 2
solve 2
problems 8
really 46
loved 11
were 23
much 43
better 27
pc 10
ps 14
wish 7
new 25
platforms 2
quickly 7
plays 5
machine 2
already 12
gamer 5
glad 3
ordered 9
nostalgia 2
awesome 11
helps 4
perfect 19
case 17
booklet 2
got 33
here 13
super 6
fast 6
ever 22
totally 3
beat 10
bad 21
guys 2
beginning 2
no 39
matter 2
internet 10
dont 45
trying 11
characters 16
die 3
ryu 2
character 3
arent 2
suggest 2
getting 6
hands 8
classic 3
playstation 3
truly 2
amazing 10
experience 4
came 24
moneys 2
worth 22
favorite 4
anybody 2
should 27
ive 15
been 21
long 17
seller 2
completely 8
complete 5
disc 2
anything 4
im 21
made 15
rate 4
high 4
dragon 3
battle 2
little 20
before 12
people 10
blue 4
guy 5
cant 23
head 2
anyways 3
breath 4
fires 2
alot 5
seem 4
along 3
time 58
fire 3
gonna 3
again 20
fighting 2
style 4
same 15
dull 3
while 13
thats 7
needed 12
colors 4
detail 3
thanks 7
perfectly 11
exactly 13
advertised 3
tell 7
television 2
cable 8
working 10
expected 12
price 23
excellent 13
couldnt 8
happier 3
things 11
holds 7
stuff 4
size 2
mario 3
yet 5
something 12
make 22
every 11
know 25
else 10
life 9
family 7
wanted 7
controls 10
tricky 3
used 24
once 5
amount 5
space 7
saves 9
gamecube 14
ports 2
built 2
part 7
wii 33
system 12
cards 5
worked 15
cube 6
item 13
days 4
far 17
card 30
gc 2
quality 7
anyone 8
sure 7
without 10
doubt 2
adventure 6
otherwise 3
original 8
challenging 5
being 15
annoying 6
close 5
may 6
monkey 7
island 5
series 3
last 5
express 2
curse 2
puzzles 7
hard 20
stop 9
let 6
rough 2
simple 3
control 6
scheme 2
moving 2
bond 2
easy 12
shooting 2
ok 4
released 2
still 24
shooters 2
today 5
goldeneye 2
nintendo 7
similar 4
later 5
gadgets 2
gameplay 5
fantastic 4
since 16
action 5
missions 5
plot 3
reccomend 2
fan 15
almost 12
box 7
instruction 2
flawlessly 3
always 8
scratch 2
worry 2
purchased 10
lots 3
store 2
didnt 23
though 11
cheap 9
fans 5
where 11
young 6
data 2
room 2
different 8
having 8
trouble 3
progress 5
product 58
five 5
save 25
files 4
mail 2
everything 10
console 3
definitely 7
idea 5
problem 13
pleased 3
thank 6
compatible 7
block 2
hope 5
tried 17
recently 2
seems 11
fine 10
few 11
complaints 2
running 4
stores 2
oem 2
ask 2
grandsons 2
fit 10
received 16
months 5
issues 6
delivery 2
nothing 9
wrong 7
described 3
read 4
paid 6
sturdy 2
enough 8
expect 2
controller 17
windows 20
install 8
older 3
gets 9
real 10
table 2
nearly 4
amazoncom 3
service 4
friends 9
kid 7
figured 2
cousins 2
plus 3
wonderful 2
children 4
sound 3
effects 3
school 2
th 4
birthday 3
build 4
computers 7
those 8
watching 2
mic 6
reasonable 5
using 6
yr 2
sonhe 2
promptlyand 2
conditionthanks 2
brand 6
ships 2
customer 3
sort 2
issue 6
helpful 2
uses 2
everyday 2
frequently 3
doing 3
yourself 4
storyline 2
blast 3
zelda 4
nephew 2
rock 8
band 6
whole 10
set 10
bundle 3
beatles 2
voice 6
ya 2
cool 6
reading 4
errors 3
half 4
etc 2
moment 2
theres 5
option 2
review 3
changes 2
said 18
picked 2
choice 2
amazon 10
says 2
harder 2
ds 2
seven 3
another 12
animals 2
variety 2
cats 2
points 9
pony 2
educational 2
learn 2
ton 2
manage 2
team 2
actions 2
run 18
liked 9
limited 3
edition 2
extra 2
cars 8
challenge 4
driving 4
early 2
packaging 2
keeps 2
wont 8
appeal 2
everyone 2
stars 5
often 6
wasted 6
each 5
rating 5
although 7
change 5
both 6
single 4
player 8
world 5
serious 5
challenges 4
keep 13
pushing 2
ubisoft 3
did 26
pick 3
copy 3
certainly 2
bit 5
learning 3
curve 3
connection 2
newer 5
frustrated 2
fact 7
taking 2
rather 2
living 2
maybe 3
actually 9
boyfriend 2
enjoyed 5
anno 7
either 12
drm 2
uplay 3
account 7
order 8
youre 10
forced 2
launch 2
point 5
code 2
steam 2
sell 5
required 2
attach 2
basically 4
allow 2
stuck 3
costs 5
sim 3
city 4
id 4
wait 2
sale 2
handle 2
larger 2
interesting 4
interface 5
able 13
affect 2
ingame 2
random 6
career 4
plenty 4
modes 3
going 14
difficulty 5
thinking 2
week 2
done 5
boy 2
fired 2
create 2
thought 10
went 3
making 4
must 9
easily 8
layers 2
month 6
rally 4
european 2
market 4
isnt 8
huge 2
party 3
english 2
dirt 20
xbox 8
okay 5
started 3
laptop 3
collection 2
check 3
next 4
car 9
handling 2
small 4
delay 3
steering 3
wheel 3
track 4
faster 2
becomes 2
exciting 3
ie 2
drive 4
achieve 2
increases 2
due 5
book 3
rifts 2
section 2
especially 5
touch 2
neither 2
addition 4
arsenal 2
setting 5
written 2
art 3
originals 2
pages 2
improve 3
chess 3
short 3
guide 2
opinion 3
thing 15
lets 3
constant 2
put 8
dvd 2
wife 2
dollar 2
mode 9
overall 6
microsoft 11
live 13
installed 6
installing 4
answer 2
kinds 2
movie 8
blocks 4
example 5
picture 6
until 6
sad 2
anymore 2
support 7
somebody 3
servers 2
why 9
period 4
deal 3
x 3
probably 5
keyboard 2
impossible 6
log 4
longer 2
flaw 2
feature 3
plan 3
snow 3
incredible 3
took 6
package 5
buyer 2
looks 6
taken 3
care 2
remember 2
soon 4
version 7
actual 2
itself 4
hes 4
christmas 4
sonic 2
youll 5
damage 2
found 8
wonderfully 2
big 9
clear 3
component 3
improved 2
connected 2
sony 3
p 4
lcd 2
wasnt 7
meant 2
cables 2
makes 8
connect 3
release 2
amazingly 2
betterprior 2
reviewer 4
spot 2
landings 2
added 2
gameit 2
youtube 2
hulk 2
smash 4
such 8
guess 4
absolutely 4
easier 3
logitech 2
wireless 4
full 7
husband 3
realistic 4
night 2
seriously 4
d 4
others 7
extremely 9
crap 2
process 2
mean 6
waster 2
confusing 8
kind 5
miss 2
fix 4
however 7
reviewers 2
objective 2
hour 2
spend 3
per 2
optimizing 2
complicated 2
highly 5
owner 2
expansion 2
buying 6
move 4
thankful 2
fault 2
rated 2
expectations 3
wide 2
saved 6
couple 3
bucks 3
items 4
funny 4
forit 2
whats 2
against 2
supports 2
multiple 2
profiles 2
user 2
lack 4
comes 3
gamers 2
dance 9
revolution 3
heard 2
putting 2
feels 3
less 9
greasy 2
protector 3
dropped 2
skins 2
board 3
file 3
bother 4
top 2
company 4
behind 3
stylus 3
fits 4
surface 2
dsi 3
xl 3
device 2
color 3
hot 2
pink 3
doesnt 18
solution 3
plastic 2
fall 3
grim 4
fandango 4
film 3
noir 2
clever 2
lucas 2
arts 2
true 2
friend 2
video 9
selling 5
design 2
course 4
acting 2
dialogue 2
finished 2
job 3
sent 2
gave 6
link 3
past 2
someone 3
additionally 2
pokemon 3
runs 2
properly 2
encountered 2
battery 3
special 3
dead 2
negative 2
reviews 3
chance 4
anyway 3
obiwan 2
quigon 2
jinn 2
queen 2
jar 4
oh 3
goes 5
capability 2
races 3
major 5
knows 2
hate 4
pictures 3
stay 4
away 2
return 3
receive 3
number 2
shipping 3
cd 10
stated 2
xp 4
waste 12
piece 4
junk 2
dissapointment 2
error 5
operating 4
systems 3
volume 2
microphone 3
arcade 4
instructions 4
press 3
figure 5
f 3
large 2
corrupted 7
finish 4
season 4
plugged 4
disappointed 10
cpu 2
software 5
dated 2
hardware 3
recognize 3
deprecated 2
reason 5
home 3
known 4
wouldnt 9
open 14
checked 3
inside 4
vista 6
download 4
versions 2
unable 3
unisoft 2
load 3
hell 2
ill 3
requires 3
replay 3
shipment 2
instead 4
fake 4
key 4
codemasters 3
send 3
content 4
bye 2
onto 2
disappointment 3
help 9
joystick 2
crashed 2
pro 2
installation 4
sorry 2
privacy 2
waiting 2
failed 2
luck 2
between 2
unless 2
cannot 5
sucks 4
expensive 2
payed 2
telling 2
bug 2
end 5
crashes 2
minutes 2
fixes 2
require 2
continuous 3
honestly 2
believe 4
information 3
quite 3
tracked 2
irritating 4
turn 3
coming 2
entire 3
pointless 2
sucked 4
pay 5
main 2
including 2
reaction 2
least 8
lame 3
win 4
shame 3
scam 2
message 3
rip 2
forgot 3
stupid 3
sold 2
lesson 2
given 2
sellers 2
platform 3
correct 2
idiot 2
mac 2
total 3
knowing 2
kept 3
returning 2
konami 2
pictured 3
terrible 4
regret 3
remote 2
worst 6
bubble 2
gun 3
flying 2
experienced 2
stupidest 2
gamei 2
free 2
wasting 2
faulty 2
retrieve 2
info 2
disturbing 2
wants 2
plug 2
sd 2
biggest 5
corrupt 3
buttons 3
pads 2
third 2
controllers 3
button 6
ended 2
adaptor 2
pressed 2
response 2
screen 5
bottom 2
charge 2
remotes 4
motion 3
sensor 2
adapter 2
complaint 2
broke 2
tabs 3
poor 2
tight 2
break 2
hold 2
closed 4
cases 7
snapped 2
tab 2
skin 2
grip 2
pet 2
rib 2
mold 2
slow 2
ripped 2
pressing 2
arrow 3
mat 2
attempt 2
pad 3
disk 2
opened 2
requirements 2
toggle 3
input 2
sometimes 5
four 2
unfortunately 2
shoot 3
simply 2
horrible 4
hawx 2
correctly 2
supposed 2
worthless 2
ones 2
flaws 2
frustrating 9
dissapointing 2
forget 2
glitches 3
door 2
place 4
difficult 2
mission 3
follows 2
follow 3
facility 2
tracking 2
dealer 2
gone 2
irritates 2
mulder 6
scully 8
appearances 2
mysteryadventure 3
cds 2
xfiles 7
episode 2
craig 2
restart 2
recent 2
moves 2
weak 2
hoping 2
pov 2
land 2
